// 立即执行函数，防止变量污染 (function() {})();

//各地区CO的平均数据
(function(){
    var myChart = echarts.init(document.querySelector(".bar .chart"));
    // 2.指定配置项和数据
    var option = {
            title: {
                text: "各地区CO的平均数据",
                left: 'center'
            },
            color: ["#3398DB"],
            xAxis: {
                type: 'category',
                data: ['伍家岭','天心区环保局','沙坪','湖南中医药大学','湖南师范大学','火车新站','经开区环保局','雨花区环保局','马坡岭','高开区环保局'],
                axisLabel: {
                    interval: 0,//横轴信息全部显示  
                    rotate: 75,
                },
            },
            yAxis: {
                type: 'value'
            },
            series: [
                {
                    type: 'bar',
                    label: { // 柱状图上的文字设置
                        show: true, // 是否显示
                        rotate: 45, // 旋转角度
                        position: 'top' // 显示位置
                    },
                    barWidth: '60%', // 柱的宽度
                    data: [1.462515152,0.8569899,0.962951461,0.905436363,0.763989581,1.854670105,0.7354433,0.717292451,0.653629211,0.852442305],
                    itemStyle: {
                        // 修改柱子圆角
                        barBorderRadius: 5
                    }
                }
            ]
        }
    // 3.把配置项给实例对象
    myChart.setOption(option);
    // 4.让图表随屏幕自适应
    window.addEventListener('resize', function () {
        myChart.resize();
    })
})();

//高开区环保局SO2与NO2变化
(function() {
    var MyChart = echarts.init(document.querySelector('.line .chart'));
    option = {
        title: {
            text: '高开区环保局SO2与NO2变化',
            // left:'center'
        },
        tooltip: {
            trigger: 'axis'
        },
        dataZoom:{
          // 这个dataZoom组件，也控制x轴。
            type: 'slider',
            show: true,
            xAxisIndex: [0],
            start: 1,
            end: 50         // 右边在 60% 的位置。
        },
        legend: {
            data: ['SO2', 'NO2']
        },
        toolbox: {
            show: true,
            feature: {
                dataZoom: {
                    yAxisIndex: 'none'
                },
                dataView: {readOnly: false},
                magicType: {type: ['line', 'bar']},
                restore: {},
                saveAsImage: {}
            }
        },
        xAxis: {
            type: 'category',
            boundaryGap: false,
            data: ['2014-06-01', '2014-06-01', '2014-06-01', '2014-06-02', '2014-06-02', '2014-06-02', '2014-06-02', '2014-06-02', '2014-06-03', '2014-06-03', '2014-06-03', '2014-06-04', '2014-06-04', '2014-06-04', '2014-06-04', '2014-06-05', '2014-06-05', '2014-06-05', '2014-06-05', '2014-06-05', '2014-06-06', '2014-06-06', '2014-06-06', '2014-06-07', '2014-06-07', '2014-06-07', '2014-06-08', '2014-06-08', '2014-06-08', '2014-06-08', '2014-06-08', '2014-06-09', '2014-06-09', '2014-06-09', '2014-06-09', '2014-06-10', '2014-06-10', '2014-06-10', '2014-06-10', '2014-06-10', '2014-06-11', '2014-06-11', '2014-06-11', '2014-06-11', '2014-06-11', '2014-06-12', '2014-06-12', '2014-06-12', '2014-06-13', '2014-06-13', '2014-06-13', '2014-06-13', '2014-06-13', '2014-06-14', '2014-06-14', '2014-06-15', '2014-06-15', '2014-06-15', '2014-06-15', '2014-06-16', '2014-06-17', '2014-06-17', '2014-06-17', '2014-06-17', '2014-06-17', '2014-06-17', '2014-06-18', '2014-06-18', '2014-06-18', '2014-06-18', '2014-06-18', '2014-06-19', '2014-06-19', '2014-06-19', '2014-06-20', '2014-06-20', '2014-06-20', '2014-06-21', '2014-06-21', '2014-06-21', '2014-06-22', '2014-06-22', '2014-06-23', '2014-06-24', '2014-06-24', '2014-06-24', '2014-06-24', '2014-06-24', '2014-06-25', '2014-06-25', '2014-06-26', '2014-06-26', '2014-06-26', '2014-06-27', '2014-06-27', '2014-06-27', '2014-06-27', '2014-06-27', '2014-06-28', '2014-06-28', '2014-06-29', '2014-06-29', '2014-06-29', '2014-06-29']
        },
        yAxis: {
            type: 'value',
            axisLabel: {
                formatter: '{value}'
            }
        },
        series: [
            {
                name: 'SO2',
                type: 'line',
                smooth: true,//平滑曲线
                data: [33, 7, 8, 21, 24, 23, 31, 29, 39, 15, 39, 13, 40, 13, 43, 16, 18, 12, 14, 15, 29, 35, 18, 41, 33, 54, 57, 32, 44, 40, 76, 55, 48, 60, 43, 21, 18, 43, 43, 26, 42, 58, 25, 29, 26, 41, 31, 25, 26, 30, 39, 23, 33, 20, 20, 14, 16, 14, 28, 0, 18, 17, 18, 54, 24, 25, 31, 32, 42, 32, 91, 20, 25, 44, 18, 19, 18, 26, 26, 26, 33, 46, 24, 15, 20, 16, 15, 17, 19, 25, 25, 21, 25, 29, 26, 25, 33, 30, 90, 21, 34, 45, 25, 21],
                markPoint: {
                    data: [
                        {type: 'max', name: '最大值'},
                        {type: 'min', name: '最小值'}
                    ]
                },
                markLine: {
                    data: [
                        {type: 'average', name: '平均值'}
                    ]
                }
            },
            {
                name: 'NO2',
                type: 'line',
                smooth: true,//平滑曲线
                data: [24, 16, 22, 21, 34, 25, 25, 34, 26, 23, 24, 24, 27, 26, 30, 23, 23, 18, 30, 25, 18, 20, 23, 22, 22, 25, 31, 28, 24, 21, 29, 27, 25, 23, 37, 50, 21, 24, 31, 39, 28, 46, 28, 28, 30, 74, 82, 28, 36, 29, 29, 31, 33, 30, 25, 22, 18, 23, 67, 36, 30, 30, 37, 43, 36, 49, 42, 53, 40, 40, 47, 32, 45, 42, 36, 34, 34, 39, 23, 23, 28, 29, 30, 36, 31, 31, 31, 34, 27, 34, 26, 23, 29, 28, 28, 27, 28, 32, 27, 46, 39, 33, 29, 32],
                markPoint: {
                    data: [
                        {name: '周最低', value: -2, xAxis: 1, yAxis: -1.5}
                    ]
                },
                markLine: {
                    data: [
                        {type: 'average', name: '平均值'},
                        [{
                            symbol: 'none',
                            x: '90%',
                            yAxis: 'max'
                        }, {
                            symbol: 'circle',
                            label: {
                                position: 'start',
                                formatter: '最大值'
                            },
                            type: 'max',
                            name: '最高点'
                        }]
                    ]
                }
            }
        ]
    };
    MyChart.setOption(option)

})();